import sys

def solve(array): # Тут має бути массив типу ["12", "1", "42"]

    if sum([int(e) for e in array]) % 2 == 0: # Переіпяєм чи массив вже не парний
        return "YES"

    for el in array: #Якшо непарний, то перевіряєм всі елементи
        first_num = el[0] # Берем першу цифру числа
        for num in el: # І перевіряєм чи є в числі цифра з іншою остачею від двійки
            if int(num) % 2 != int(first_num) % 2:
                return "YES" #Така існує то далі перевіряти немає сенсу, цього дость
                                     # що сказати що ми можемо переробити массив на парний
    return "NO"


if __name__ == "__main__":
    data = sys.stdin.read().split("\n") #Берем всі рядки одразу і ділимо по ентерах

    for test in data[2::2]: #Так як ми на пітоні то кількість тестів як і кількість
        print(solve(test.split())) # елементів в массиві нам нідочого